In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
data = {
    'Produk': ['A', 'B', 'C', 'A', 'B', 'C', 'A'],
    'Tanggal': ['2025-08-01', '2025-08-01', '2025-08-01', 
                '2025-08-02', '2025-08-02', '2025-08-02', '2025-08-03'],
    'Jumlah_Terjual': [10, 15, 5, 8, 20, 7, 12],
    'Harga_Satuan': [10000, 20000, 15000, 10000, 20000, 15000, 10000]
}

In [17]:
df = pd.DataFrame(data)
df

  Produk     Tanggal  Jumlah_Terjual  Harga_Satuan
0      A  2025-08-01              10         10000
1      B  2025-08-01              15         20000
2      C  2025-08-01               5         15000
3      A  2025-08-02               8         10000
4      B  2025-08-02              20         20000
5      C  2025-08-02               7         15000
6      A  2025-08-03              12         10000

In [34]:
df['Total'] = df['Jumlah_Terjual'] * df['Harga_Satuan']
df

  Produk     Tanggal  Jumlah_Terjual  Harga_Satuan   Total
0      A  2025-08-01              10         10000  100000
1      B  2025-08-01              15         20000  300000
2      C  2025-08-01               5         15000   75000
3      A  2025-08-02               8         10000   80000
4      B  2025-08-02              20         20000  400000
5      C  2025-08-02               7         15000  105000
6      A  2025-08-03              12         10000  120000

In [49]:
pendapatan_perhari = df.groupby('Tanggal')['Total'].sum()
print(pendapatan_perhari)

Tanggal
2025-08-01    475000
2025-08-02    585000
2025-08-03    120000
Name: Total, dtype: int64

In [65]:
produk_terlaris = df.groupby('Produk')['Jumlah_Terjual'].sum()
print(produk_terlaris)

Produk
A    30
B    35
C    12
Name: Jumlah_Terjual, dtype: int64

In [46]:
df ['rata_penjualan'] = df.groupby('Produk')['Jumlah_Terjual'].transform('mean').round()
df

  Produk     Tanggal  Jumlah_Terjual  Harga_Satuan   Total  rata_penjualan
0      A  2025-08-01              10         10000  100000            10.0
1      B  2025-08-01              15         20000  300000            18.0
2      C  2025-08-01               5         15000   75000             6.0
3      A  2025-08-02               8         10000   80000            10.0
4      B  2025-08-02              20         20000  400000            18.0
5      C  2025-08-02               7         15000  105000             6.0
6      A  2025-08-03              12         10000  120000            10.0

In [58]:
penjualan_diatas_10 = df[df['Jumlah_Terjual']>10]
penjualan_diatas_10

,Produk,Tanggal,Jumlah_Terjual,Harga_Satuan,Total,rata_penjualan,pendapatan_perhari
1,B,2025-08-01,15,20000,300000,18.0,475000
4,B,2025-08-02,20,20000,400000,18.0,585000
6,A,2025-08-03,12,10000,120000,10.0,120000

In [61]:
df['Tanggal'] = pd.to_datetime(df['Tanggal'], dayfirst = 'True')
print(df.dtypes)

Produk                        object
Tanggal               datetime64[ns]
Jumlah_Terjual                 int64
Harga_Satuan                   int64
Total                          int64
rata_penjualan               float64
pendapatan_perhari             int64
dtype: object

In [63]:
produk_B = df[df['Produk'] == 'B' ]
produk_B

,Produk,Tanggal,Jumlah_Terjual,Harga_Satuan,Total,rata_penjualan,pendapatan_perhari
1,B,2025-08-01,15,20000,300000,18.0,475000
4,B,2025-08-02,20,20000,400000,18.0,585000

In [ ]:
summary
- Total pendapatan per hari berhasil dihitung.
- Produk dengan penjualan terbanyak adalah produk B 35 buah
- Rata-rata penjualan per produk telah ditampilkan.
- Filter penjualan > 10 unit berhasil diterapkan.
- Format tanggal telah dikonversi ke datetime.
- Data penjualan khusus produk B sudah difilter.